app/views/cmmnts/_comments.html.erb

<% @post.cmmnts.each do |comment| %>
---
SELECT "cmmnts".* FROM "cmmnts" WHERE "cmmnts"."post_id" = ?  [["post_id", 91]]