app/views/posts/index.html.erb

<hr>
<% @rubric.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "posts_rubrics" ON "posts"."id" = "posts_rubrics"."post_id" WHERE "posts_rubrics"."rubric_id" = ?  [["rubric_id", 12]]

      <h2 class="title"><%= link_to post.title, rubric_post_path(@rubric, post)%></h2>
      <p>Comments <span class="badge"><%= post.cmmnts.count %></span></p>
---
SELECT COUNT(*) FROM "cmmnts" WHERE "cmmnts"."post_id" = ?  [["post_id", 101]]