app/views/rubrics/index.html.erb

      <h2 class="title"><%= link_to rubric.title, rubric %></h2>
      <p>Posts <span class="badge"><%= rubric.posts.count %></span></p>
---
SELECT COUNT(*) FROM "posts" INNER JOIN "posts_rubrics" ON "posts"."id" = "posts_rubrics"."post_id" WHERE "posts_rubrics"."rubric_id" = ?  [["rubric_id", 12]]