app/controllers/cmmnts_controller.rb

  def create
    @cmmnt = @post.cmmnts.create(params[:cmmnt].permit( :body))
---
INSERT INTO "cmmnts" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "privet"], ["post_id", 91], ["created_at", "2017-01-04 18:18:32.953970"], ["updated_at", "2017-01-04 18:18:32.953970"]]

  def destroy
    @cmmnt = Cmmnt.find(params[:id])
    @cmmnt.destroy
---
SELECT  "cmmnts".* FROM "cmmnts" WHERE "cmmnts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "cmmnts" WHERE "cmmnts"."id" = ?  [["id", 1]]

  def load_params
    @rubric = Rubric.find(params[:rubric_id])
    @post = @rubric.posts.find(params[:post_id])
---
SELECT  "rubrics".* FROM "rubrics" WHERE "rubrics"."id" = ? LIMIT 1  [["id", 10]]
SELECT  "posts".* FROM "posts" INNER JOIN "posts_rubrics" ON "posts"."id" = "posts_rubrics"."post_id" WHERE "posts_rubrics"."rubric_id" = ? AND "posts"."id" = ? LIMIT 1  [["rubric_id", 10], ["id", 91]]