app/controllers/posts_controller.rb

SELECT  "rubrics".* FROM "rubrics" WHERE "rubrics"."id" = ? LIMIT 1  [["id", 12]]
---
  def load_rubric_params
    @rubric = Rubric.find(params[:rubric_id])

SELECT  "posts".* FROM "posts" INNER JOIN "posts_rubrics" ON "posts"."id" = "posts_rubrics"."post_id" WHERE "posts_rubrics"."rubric_id" = ? AND "posts"."id" = ? LIMIT 1  [["rubric_id", 10], ["id", 91]]
---
  def load_post_params
    @post = @rubric.posts.find(params[:id])