app/controllers/rubrics_controller.rb

  def index
    @rubric = Rubric.paginate(:page => params[:page], :per_page => 4).order('created_at DESC')
---
SELECT  "rubrics".* FROM "rubrics"  ORDER BY created_at DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "rubrics"

  def destroy
    @rubric.destroy
---
DELETE FROM "rubrics" WHERE "rubrics"."id" = ?  [["id", 12]]

  def load_params
    @rubric = Rubric.find(params[:id])
---
SELECT  "rubrics".* FROM "rubrics" WHERE "rubrics"."id" = ? LIMIT 1  [["id", 12]]